
# State **`s3://infrahouse-aws-control-990466748045/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |    Change |    Destroy |
|----------:|---------:|----------:|-----------:|
|        ✅ |       20 |         0 |          0 |
## Affected resources by action

|  Action  | Resources                                                                                                       |
|:--------:|:----------------------------------------------------------------------------------------------------------------|
|    🟢    | `aws_iam_policy.github_cross_account`                                                                           |
|    🟢    | `aws_iam_role_policy_attachment.github_cross_account`                                                           |
|    🟢    | `module.github_connector_338531211565.aws_iam_openid_connect_provider.github`                                   |
|    🟢    | `module.ih_tf_aws_control_338531211565.aws_iam_policy.github`                                                   |
|    🟢    | `module.ih_tf_aws_control_338531211565.aws_iam_role.admin`                                                      |
|    🟢    | `module.ih_tf_aws_control_338531211565.aws_iam_role.github`                                                     |
|    🟢    | `module.ih_tf_aws_control_338531211565.aws_iam_role_policy_attachment.admin`                                    |
|    🟢    | `module.ih_tf_aws_control_338531211565.aws_iam_role_policy_attachment.github`                                   |
|    🟢    | `module.state_bucket_338531211565.aws_dynamodb_table.terraform_locks`                                           |
|    🟢    | `module.state_bucket_338531211565.aws_s3_bucket.state-bucket`                                                   |
|    🟢    | `module.state_bucket_338531211565.aws_s3_bucket_policy.state-bucke`                                             |
|    🟢    | `module.state_bucket_338531211565.aws_s3_bucket_public_access_block.public_access`                              |
|    🟢    | `module.state_bucket_338531211565.aws_s3_bucket_server_side_encryption_configuration.default`                   |
|    🟢    | `module.state_bucket_338531211565.aws_s3_bucket_versioning.enabled`                                             |
|    🟢    | `module.state_bucket_338531211565.random_pet.suffix`                                                            |
|    🟢    | `module.ih_tf_aws_control_338531211565.module.state-manager.aws_iam_policy.permissions_ro`                      |
|    🟢    | `module.ih_tf_aws_control_338531211565.module.state-manager.aws_iam_policy.permissions_rw`                      |
|    🟢    | `module.ih_tf_aws_control_338531211565.module.state-manager.aws_iam_role.state-manager`                         |
|    🟢    | `module.ih_tf_aws_control_338531211565.module.state-manager.aws_iam_role_policy_attachment.state-manager-ro`    |
|    🟢    | `module.ih_tf_aws_control_338531211565.module.state-manager.aws_iam_role_policy_attachment.state-manager-rw[0]` |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_iam_policy.github_cross_account will be created
  + resource "aws_iam_policy" "github_cross_account" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allow ih-tf-aws-control-github to assume roles in managed accounts"
      + id               = (known after apply)
      + name             = "ih-tf-aws-control-github-cross-account"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "sts:AssumeRole"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:iam::338531211565:role/AWSControlTowerExecution",
                          + "arn:aws:iam::289256138624:role/AWSControlTowerExecution",
                        ]
                      + Sid      = "AssumeControlTowerExecution"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "created_by"  = "infrahouse/aws-control"
          + "environment" = "production"
        }
    }

  # aws_iam_role_policy_attachment.github_cross_account will be created
  + resource "aws_iam_role_policy_attachment" "github_cross_account" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ih-tf-aws-control-github"
    }

  # module.github_connector_338531211565.aws_iam_openid_connect_provider.github will be created
  + resource "aws_iam_openid_connect_provider" "github" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "created_by_module" = "infrahouse/gh-identity-provider/aws"
          + "module_version"    = "1.1.1"
        }
      + tags_all        = {
          + "created_by"        = "infrahouse/aws-control"
          + "created_by_module" = "infrahouse/gh-identity-provider/aws"
          + "environment"       = "production"
          + "module_version"    = "1.1.1"
        }
      + thumbprint_list = [
          + "6938fd4d98bab03faadb97b34396831e3780aea1",
          + "1c58a3a8518e8759bf075b76b750d4f2df264fcd",
        ]
      + url             = "https://token.actions.githubusercontent.com"
    }

  # module.ih_tf_aws_control_338531211565.data.aws_iam_openid_connect_provider.github will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_openid_connect_provider" "github" {
      + arn             = (known after apply)
      + client_id_list  = (known after apply)
      + id              = (known after apply)
      + tags            = (known after apply)
      + thumbprint_list = (known after apply)
      + url             = "https://token.actions.githubusercontent.com"
    }

  # module.ih_tf_aws_control_338531211565.data.aws_iam_policy.admin will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy" "admin" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = (known after apply)
      + id               = (known after apply)
      + name             = "AdministratorAccess"
      + path             = (known after apply)
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = (known after apply)
    }

  # module.ih_tf_aws_control_338531211565.data.aws_iam_policy_document.admin-trust will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "admin-trust" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]

          + principals {
              + identifiers = [
                  + "arn:aws:iam::990466748045:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_16bdbe5eb442e7ef",
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.ih_tf_aws_control_338531211565.data.aws_iam_policy_document.github-permissions will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "github-permissions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sts:AssumeRole",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.ih_tf_aws_control_338531211565.data.aws_iam_policy_document.github-permissions-assume-all will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "github-permissions-assume-all" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sts:AssumeRole",
            ]
          + resources = [
              + "*",
            ]
        }
    }

  # module.ih_tf_aws_control_338531211565.data.aws_iam_policy_document.github-trust will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "github-trust" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = "token.actions.githubusercontent.com:aud"
            }
          + condition {
              + test     = "StringLike"
              + values   = [
                  + "repo:infrahouse/aws-control-338531211565:*",
                ]
              + variable = "token.actions.githubusercontent.com:sub"
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.ih_tf_aws_control_338531211565.aws_iam_policy.github will be created
  + resource "aws_iam_policy" "github" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "ih-tf-aws-control-338531211565-github"
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "created_by_module" = "infrahouse/gha-admin/aws"
        }
      + tags_all         = {
          + "created_by"        = "infrahouse/aws-control"
          + "created_by_module" = "infrahouse/gha-admin/aws"
          + "environment"       = "production"
        }
    }

  # module.ih_tf_aws_control_338531211565.aws_iam_role.admin will be created
  + resource "aws_iam_role" "admin" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + description           = "Role to manage AWS account"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 43200
      + name                  = "ih-tf-aws-control-338531211565-admin"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "created_by_module" = "infrahouse/gha-admin/aws"
          + "module_version"    = "3.6.1"
        }
      + tags_all              = {
          + "created_by"        = "infrahouse/aws-control"
          + "created_by_module" = "infrahouse/gha-admin/aws"
          + "environment"       = "production"
          + "module_version"    = "3.6.1"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ih_tf_aws_control_338531211565.aws_iam_role.github will be created
  + resource "aws_iam_role" "github" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + description           = "Role for a GitHub Actions runner in repo aws-control-338531211565"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 43200
      + name                  = "ih-tf-aws-control-338531211565-github"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "created_by_module" = "infrahouse/gha-admin/aws"
        }
      + tags_all              = {
          + "created_by"        = "infrahouse/aws-control"
          + "created_by_module" = "infrahouse/gha-admin/aws"
          + "environment"       = "production"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ih_tf_aws_control_338531211565.aws_iam_role_policy_attachment.admin will be created
  + resource "aws_iam_role_policy_attachment" "admin" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ih-tf-aws-control-338531211565-admin"
    }

  # module.ih_tf_aws_control_338531211565.aws_iam_role_policy_attachment.github will be created
  + resource "aws_iam_role_policy_attachment" "github" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ih-tf-aws-control-338531211565-github"
    }

  # module.state_bucket_338531211565.data.aws_iam_policy_document.enforce_ssl_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "enforce_ssl_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "AllowSSLRequestsOnly"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # module.state_bucket_338531211565.aws_dynamodb_table.terraform_locks will be created
  + resource "aws_dynamodb_table" "terraform_locks" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = (known after apply)
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "VantaNoAlert"      = "Table used for Terraform state lock and does not contain user data"
          + "created_by_module" = "infrahouse/state-bucket/aws"
          + "state_bucket"      = "infrahouse-aws-control-338531211565"
        }
      + tags_all         = {
          + "VantaNoAlert"      = "Table used for Terraform state lock and does not contain user data"
          + "created_by"        = "infrahouse/aws-control"
          + "created_by_module" = "infrahouse/state-bucket/aws"
          + "environment"       = "production"
          + "state_bucket"      = "infrahouse-aws-control-338531211565"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockID"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # module.state_bucket_338531211565.aws_s3_bucket.state-bucket will be created
  + resource "aws_s3_bucket" "state-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "infrahouse-aws-control-338531211565"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.state_bucket_338531211565.aws_s3_bucket_policy.state-bucke will be created
  + resource "aws_s3_bucket_policy" "state-bucke" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.state_bucket_338531211565.aws_s3_bucket_public_access_block.public_access will be created
  + resource "aws_s3_bucket_public_access_block" "public_access" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.state_bucket_338531211565.aws_s3_bucket_server_side_encryption_configuration.default will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "default" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.state_bucket_338531211565.aws_s3_bucket_versioning.enabled will be created
  + resource "aws_s3_bucket_versioning" "enabled" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.state_bucket_338531211565.random_pet.suffix will be created
  + resource "random_pet" "suffix" {
      + id        = (known after apply)
      + length    = 2
      + prefix    = "infrahouse-aws-control-338531211565"
      + separator = "-"
    }

  # module.ih_tf_aws_control_338531211565.module.state-manager.data.aws_iam_policy_document.assume will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + sid     = "000"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::990466748045:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_16bdbe5eb442e7ef",
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.ih_tf_aws_control_338531211565.module.state-manager.data.aws_iam_policy_document.permissions_ro will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "permissions_ro" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::infrahouse-aws-control-338531211565",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::infrahouse-aws-control-338531211565/*.zip",
              + "arn:aws:s3:::infrahouse-aws-control-338531211565/plans/*",
              + "arn:aws:s3:::infrahouse-aws-control-338531211565/terraform.tfstate",
            ]
        }
    }

  # module.ih_tf_aws_control_338531211565.module.state-manager.data.aws_iam_policy_document.permissions_rw will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "permissions_rw" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::infrahouse-aws-control-338531211565/*.zip",
              + "arn:aws:s3:::infrahouse-aws-control-338531211565/plans/*",
              + "arn:aws:s3:::infrahouse-aws-control-338531211565/terraform.tfstate",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:DeleteItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.ih_tf_aws_control_338531211565.module.state-manager.aws_iam_policy.permissions_ro will be created
  + resource "aws_iam_policy" "permissions_ro" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "ih-tf-aws-control-338531211565-state-manager-ro"
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "created_by_module" = "infrahouse/state-manager/aws"
        }
      + tags_all         = {
          + "created_by"        = "infrahouse/aws-control"
          + "created_by_module" = "infrahouse/state-manager/aws"
          + "environment"       = "production"
        }
    }

  # module.ih_tf_aws_control_338531211565.module.state-manager.aws_iam_policy.permissions_rw will be created
  + resource "aws_iam_policy" "permissions_rw" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "ih-tf-aws-control-338531211565-state-manager-rw"
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "created_by_module" = "infrahouse/state-manager/aws"
        }
      + tags_all         = {
          + "created_by"        = "infrahouse/aws-control"
          + "created_by_module" = "infrahouse/state-manager/aws"
          + "environment"       = "production"
        }
    }

  # module.ih_tf_aws_control_338531211565.module.state-manager.aws_iam_role.state-manager will be created
  + resource "aws_iam_role" "state-manager" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + description           = "Role to manage a terraform state of a repo"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 43200
      + name                  = "ih-tf-aws-control-338531211565-state-manager"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "created_by_module" = "infrahouse/state-manager/aws"
          + "module_version"    = "1.4.2"
        }
      + tags_all              = {
          + "created_by"        = "infrahouse/aws-control"
          + "created_by_module" = "infrahouse/state-manager/aws"
          + "environment"       = "production"
          + "module_version"    = "1.4.2"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ih_tf_aws_control_338531211565.module.state-manager.aws_iam_role_policy_attachment.state-manager-ro will be created
  + resource "aws_iam_role_policy_attachment" "state-manager-ro" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ih-tf-aws-control-338531211565-state-manager"
    }

  # module.ih_tf_aws_control_338531211565.module.state-manager.aws_iam_role_policy_attachment.state-manager-rw[0] will be created
  + resource "aws_iam_role_policy_attachment" "state-manager-rw" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ih-tf-aws-control-338531211565-state-manager"
    }

Plan: 20 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDIwLCAiY2hhbmdlIjogMCwgImRlc3Ryb3kiOiAwfX0=
```
</details>